/*描述
写个算法，对2个小于1000000000的输入，求结果。 特殊乘法举例：123 * 45 = 1*4 +1*5 +2*4 +2*5 +3*4+3*5
输入描述：
两个小于1000000000的数
输出描述：
输入可能有多组数据，对于每一组数据，输出Input中的两个数按照题目要求的方法进行运算后得到的结果。*/


// 123 * 45 = 1*4 +1*5 +2*4 +2*5 +3*4+3*5 = 1*(4+5) +2*(4+5) 3*(4+5) = (1+2+3)*(4+5)
#include <iostream>

using namespace std;

int main (){
    freopen("./ky18.data","r",stdin);
    int A,B,sum=0,a[10]={0},b[10]={0};
    while(cin>>A && cin>>B){
        int tmp=B,sum=0;
        while(A>0){
            while(B>0){//用第二个数的每一位与地一个数相乘做和
                sum += (A%10)*(B%10);
                B /=10;
            }
            B=tmp;//还原
            A/=10;
        }
        cout << sum << endl;
    }
    return 0;
}